RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl702/std/include/bl702_gpio.h
#define GPIO18_FUN_BT_ABORT            1
#define GPIO18_FUN_SF_IO_1             2
#define GPIO18_FUN_I2S0_DIO_I2S0_DO    3
#define GPIO18_FUN_SPI_0_SS            4
#define GPIO18_FUN_I2C0_SCL            6
#define GPIO18_FUN_UART_SIG2_UART_SIG6 7
#define GPIO18_FUN_PWM_CH3             8
#define GPIO18_FUN_PIX_DAT5            9
#define GPIO18_FUN_GPIP_CH_8           10
#define GPIO18_FUN_REG_GPIO_18         11
#define GPIO18_FUN_RF_TEST_13          12
#define GPIO18_FUN_UNUSED13            13
#define GPIO18_FUN_E21_TCK_E21_TMS     14
#define GPIO18_FUN_M_CCI_CLK_DEBUG_14  15
#define GPIO18_FUN_FEM_GPIO_3          16
#define GPIO18_FUN_USB_SUS_EXT         17
#define GPIO18_FUN_USB_SUS             18
#define GPIO18_FUN_RMII_MDC            19
#define GPIO18_FUN_QDEC0_A             20
#define GPIO18_FUN_ROW_I_2             21
#define GPIO18_FUN_COL_O_18            22
#define GPIO18_FUN_CAM_PWRDN           23
/* GPIO19 function definition */
#define GPIO19_FUN_CLK_OUT_1           0
#define GPIO19_FUN_BT_ACTIVE           1
#define GPIO19_FUN_SF_CS               2
#define GPIO19_FUN_I2S0_RCLK_O_I2S0_DI 3
#define GPIO19_FUN_SPI_0_SCLK          4
#define GPIO19_FUN_I2C0_SDA            6
#define GPIO19_FUN_UART_SIG3_UART_SIG7 7
#define GPIO19_FUN_PWM_CH4             8
#define GPIO19_FUN_PIX_DAT6            9
#define GPIO19_FUN_GPIP_CH_9           10
#define GPIO19_FUN_REG_GPIO_19         11
#define GPIO19_FUN_RF_TEST_14          12
#define GPIO19_FUN_UNUSED13            13
#define GPIO19_FUN_E21_TDO_E21_TDI     14
#define GPIO19_FUN_M_CCI_CS_DEBUG_15   15
#define GPIO19_FUN_FEM_GPIO_4          16
#define GPIO19_FUN_USB_ENUM_EXT        17
#define GPIO19_FUN_USB_ENUM            18
#define GPIO19_FUN_RMII_MDIO           19
#define GPIO19_FUN_QDEC0_B             20
#define GPIO19_FUN_ROW_I_3             21
#define GPIO19_FUN_COL_O_19            22
#define GPIO19_FUN_CAM_REF_CLK         23
/* GPIO20 function definition */
#define GPIO20_FUN_CLK_OUT_0             0
#define GPIO20_FUN_BT_PRI                1
#define GPIO20_FUN_SF_IO_3               2
#define GPIO20_FUN_I2S0_BCLK             3
#define GPIO20_FUN_SPI_0_MOSI_SPI_0_MISO 4
#define GPIO20_FUN_I2C0_SCL              6
#define GPIO20_FUN_UART_SIG4_UART_SIG0   7
#define GPIO20_FUN_PWM_CH0               8
#define GPIO20_FUN_PIX_DAT7              9
#define GPIO20_FUN_GPIP_CH_10            10
#define GPIO20_FUN_REG_GPIO_20           11
#define GPIO20_FUN_RF_TEST_15            12
#define GPIO20_FUN_UNUSED13              13
#define GPIO20_FUN_E21_TMS_E21_TCK       14
#define GPIO20_FUN_M_CCI_DI_DEBUG_16     15
#define GPIO20_FUN_FEM_GPIO_0            16
#define GPIO20_FUN_USB_TX_DN_USB_RX_DN   17
#define GPIO20_FUN_USB_OEB               18
#define GPIO20_FUN_RMII_RXERR            19
#define GPIO20_FUN_QDEC0_LED             20
#define GPIO20_FUN_ROW_I_4               21
#define GPIO20_FUN_COL_O_0               22
#define GPIO20_FUN_CAM_RESET             23
/* GPIO21 function definition */
#define GPIO21_FUN_CLK_OUT_1             0
#define GPIO21_FUN_BT_ABORT              1
#define GPIO21_FUN_SF_CLK                2
#define GPIO21_FUN_I2S0_FS               3
#define GPIO21_FUN_SPI_0_MISO_SPI_0_MOSI 4
#define GPIO21_FUN_I2C0_SDA              6
#define GPIO21_FUN_UART_SIG5_UART_SIG1   7
#define GPIO21_FUN_PWM_CH1               8
#define GPIO21_FUN_UNUSED9               9
#define GPIO21_FUN_GPIP_CH_11            10
#define GPIO21_FUN_REG_GPIO_21           11
#define GPIO21_FUN_RF_TEST_16            12
#define GPIO21_FUN_UNUSED13              13
#define GPIO21_FUN_E21_TDI_E21_TDO       14
#define GPIO21_FUN_M_CCI_DO_DEBUG_17     15
#define GPIO21_FUN_FEM_GPIO_1            16
#define GPIO21_FUN_USB_TX_OE             17
#define GPIO21_FUN_VOP                   18
#define GPIO21_FUN_RMII_TX_EN            19
#define GPIO21_FUN_QDEC1_A               20
#define GPIO21_FUN_ROW_I_5               21
#define GPIO21_FUN_COL_O_1               22
#define GPIO21_FUN_CAM_PWRDN             23
/* GPIO22 function definition */
#define GPIO22_FUN_CLK_OUT_0           0
#define GPIO22_FUN_BT_ACTIVE           1
#define GPIO22_FUN_SF_IO_2             2
#define GPIO22_FUN_I2S0_DIO_I2S0_DO    3
#define GPIO22_FUN_SPI_0_SS            4
#define GPIO22_FUN_I2C0_SCL            6
#define GPIO22_FUN_UART_SIG6_UART_SIG2 7
#define GPIO22_FUN_PWM_CH2             8
#define GPIO22_FUN_UNUSED9             9
#define GPIO22_FUN_LEDDRV_0            10
#define GPIO22_FUN_REG_GPIO_22         11
#define GPIO22_FUN_RF_TEST_17          12
#define GPIO22_FUN_UNUSED13            13
#define GPIO22_FUN_E21_TCK_E21_TMS     14
#define GPIO22_FUN_DEBUG_18            15
#define GPIO22_FUN_FEM_GPIO_2          16
#define GPIO22_FUN_USB_TX_DP_USB_RX_DP 17
#define GPIO22_FUN_VOM                 18
#define GPIO22_FUN_RMII_RX_DV          19
#define GPIO22_FUN_QDEC1_B             20
#define GPIO22_FUN_ROW_I_6             21
#define GPIO22_FUN_COL_O_2             22
#define GPIO22_FUN_CAM_REF_CLK         23
/* GPIO23 function definition */
#define GPIO23_FUN_CLK_OUT_1                 0
#define GPIO23_FUN_BT_PRI                    1
#define GPIO23_FUN_SF2_IO_2_SF3_CS2          2
#define GPIO23_FUN_I2S0_RCLK_O_I2S0_DI       3
#define GPIO23_FUN_SPI_0_SCLK                4
#define GPIO23_FUN_I2C0_SDA                  6
#define GPIO23_FUN_UART_SIG7_UART_SIG3       7
#define GPIO23_FUN_PWM_CH3                   8
#define GPIO23_FUN_PIX_DAT4                  9
#define GPIO23_FUN_LEDDRV_1_FLASH_PULL_OUT_0 10
#define GPIO23_FUN_REG_GPIO_23               11
#define GPIO23_FUN_RF_TEST_18                12
#define GPIO23_FUN_UNUSED13                  13
#define GPIO23_FUN_E21_TDO_E21_TDI           14
#define GPIO23_FUN_DEBUG_19                  15
#define GPIO23_FUN_FEM_GPIO_3                16
#define GPIO23_FUN_USB_SUS_EXT               17
#define GPIO23_FUN_BD                        18
#define GPIO23_FUN_UNUSED19                  19
#define GPIO23_FUN_QDEC1_LED                 20
#define GPIO23_FUN_ROW_I_7                   21
#define GPIO23_FUN_COL_O_3                   22
#define GPIO23_FUN_CAM_RESET                 23
/* GPIO24 function definition */
#define GPIO24_FUN_CLK_OUT_0             0
#define GPIO24_FUN_BT_ABORT              1
#define GPIO24_FUN_SF2_IO_1              2
#define GPIO24_FUN_I2S0_BCLK             3
#define GPIO24_FUN_SPI_0_MOSI_SPI_0_MISO 4
#define GPIO24_FUN_I2C0_SCL              6
#define GPIO24_FUN_UART_SIG0_UART_SIG4   7
#define GPIO24_FUN_PWM_CH4               8
#define GPIO24_FUN_PIX_DAT5              9
#define GPIO24_FUN_FLASH_PULL_OUT_1      10
#define GPIO24_FUN_REG_GPIO_24           11
#define GPIO24_FUN_RF_TEST_19            12
#define GPIO24_FUN_UNUSED13              13
#define GPIO24_FUN_E21_TMS_E21_TCK       14
#define GPIO24_FUN_DEBUG_20              15
#define GPIO24_FUN_FEM_GPIO_4            16
#define GPIO24_FUN_USB_ENUM_EXT          17
#define GPIO24_FUN_VIP                   18
#define GPIO24_FUN_RMII_MDC              19
#define GPIO24_FUN_QDEC2_A               20
#define GPIO24_FUN_ROW_I_0               21
#define GPIO24_FUN_COL_O_4               22
#define GPIO24_FUN_CAM_PWRDN             23
/* GPIO25 function definition */
#define GPIO25_FUN_CLK_OUT_1             0
#define GPIO25_FUN_BT_ACTIVE             1
#define GPIO25_FUN_SF2_CS                2
#define GPIO25_FUN_I2S0_FS               3
#define GPIO25_FUN_SPI_0_MISO_SPI_0_MOSI 4
#define GPIO25_FUN_I2C0_SDA              6
#define GPIO25_FUN_UART_SIG1_UART_SIG5   7
#define GPIO25_FUN_PWM_CH0               8
#define GPIO25_FUN_PIX_DAT6              9
#define GPIO25_FUN_FLASH_PULL_OUT_2      10
#define GPIO25_FUN_REG_GPIO_25           11
#define GPIO25_FUN_RF_TEST_20            12
#define GPIO25_FUN_UNUSED13              13
#define GPIO25_FUN_E21_TDI_E21_TDO       14
#define GPIO25_FUN_DEBUG_21              15
#define GPIO25_FUN_FEM_GPIO_0            16
#define GPIO25_FUN_USB_TX_DN_USB_RX_DN   17
#define GPIO25_FUN_VIM                   18
#define GPIO25_FUN_RMII_MDIO             19
#define GPIO25_FUN_QDEC2_B               20
#define GPIO25_FUN_ROW_I_1               21
#define GPIO25_FUN_COL_O_5               22
#define GPIO25_FUN_CAM_REF_CLK           23
/* GPIO26 function definition */
#define GPIO26_FUN_CLK_OUT_0           0
#define GPIO26_FUN_BT_PRI              1
#define GPIO26_FUN_SF2_IO_3            2
#define GPIO26_FUN_I2S0_DIO_I2S0_DO    3
#define GPIO26_FUN_SPI_0_SS            4
#define GPIO26_FUN_I2C0_SCL            6
#define GPIO26_FUN_UART_SIG2_UART_SIG6 7
#define GPIO26_FUN_PWM_CH1             8
#define GPIO26_FUN_PIX_DAT7            9
#define GPIO26_FUN_FLASH_PULL_OUT_3    10
#define GPIO26_FUN_REG_GPIO_26         11
#define GPIO26_FUN_RF_TEST_21          12
#define GPIO26_FUN_UNUSED13            13
#define GPIO26_FUN_E21_TCK_E21_TMS     14
#define GPIO26_FUN_DEBUG_22            15
#define GPIO26_FUN_FEM_GPIO_1          16
#define GPIO26_FUN_USB_TX_OE           17
#define GPIO26_FUN_RCV                 18
#define GPIO26_FUN_RMII_RXERR          19
#define GPIO26_FUN_QDEC2_LED           20
#define GPIO26_FUN_ROW_I_2             21
#define GPIO26_FUN_COL_O_6             22
#define GPIO26_FUN_CAM_RESET           23
/* GPIO27 function definition */
#define GPIO27_FUN_CLK_OUT_1           0
#define GPIO27_FUN_BT_ABORT            1
#define GPIO27_FUN_SF2_CLK             2
#define GPIO27_FUN_I2S0_RCLK_O_I2S0_DI 3
#define GPIO27_FUN_SPI_0_SCLK          4
#define GPIO27_FUN_I2C0_SDA            6
#define GPIO27_FUN_UART_SIG3_UART_SIG7 7
#define GPIO27_FUN_PWM_CH2             8
#define GPIO27_FUN_UNUSED9             9
#define GPIO27_FUN_FLASH_PULL_OUT_4    10
#define GPIO27_FUN_REG_GPIO_27         11
#define GPIO27_FUN_RF_TEST_22          12
#define GPIO27_FUN_UNUSED13            13
#define GPIO27_FUN_E21_TDO_E21_TDI     14
#define GPIO27_FUN_DEBUG_23            15
#define GPIO27_FUN_FEM_GPIO_2          16
#define GPIO27_FUN_USB_TX_DP_USB_RX_DP 17
#define GPIO27_FUN_USB_SUS             18
#define GPIO27_FUN_RMII_TX_EN          19
#define GPIO27_FUN_QDEC0_A             20
#define GPIO27_FUN_ROW_I_3             21
#define GPIO27_FUN_COL_O_7             22
#define GPIO27_FUN_CAM_PWRDN           23
/* GPIO28 function definition */
#define GPIO28_FUN_CLK_OUT_0             0
#define GPIO28_FUN_BT_ACTIVE             1
#define GPIO28_FUN_SF2_IO_0              2
#define GPIO28_FUN_I2S0_BCLK             3
#define GPIO28_FUN_SPI_0_MOSI_SPI_0_MISO 4
#define GPIO28_FUN_I2C0_SCL              6
#define GPIO28_FUN_UART_SIG4_UART_SIG0   7
#define GPIO28_FUN_PWM_CH3               8
#define GPIO28_FUN_PIX_DAT4              9
#define GPIO28_FUN_FLASH_PULL_OUT_5      10
#define GPIO28_FUN_REG_GPIO_28           11
#define GPIO28_FUN_RF_TEST_23            12
#define GPIO28_FUN_UNUSED13              13
#define GPIO28_FUN_E21_TMS_E21_TCK       14
#define GPIO28_FUN_DEBUG_24              15
#define GPIO28_FUN_FEM_GPIO_3            16
#define GPIO28_FUN_USB_SUS_EXT           17
#define GPIO28_FUN_USB_ENUM              18
#define GPIO28_FUN_RMII_RX_DV            19
#define GPIO28_FUN_QDEC0_B               20
#define GPIO28_FUN_ROW_I_4               21
#define GPIO28_FUN_COL_O_8               22
#define GPIO28_FUN_CAM_REF_CLK           23
/* GPIO29 function definition */
#define GPIO29_FUN_CLK_OUT_1             0
#define GPIO29_FUN_BT_PRI                1
#define GPIO29_FUN_UNUSED2               2
#define GPIO29_FUN_I2S0_FS               3
#define GPIO29_FUN_SPI_0_MISO_SPI_0_MOSI 4
#define GPIO29_FUN_I2C0_SDA              6
#define GPIO29_FUN_UART_SIG5_UART_SIG1   7
#define GPIO29_FUN_PWM_CH4               8
#define GPIO29_FUN_PIX_DAT5              9
#define GPIO29_FUN_UNUSED10              10
#define GPIO29_FUN_REG_GPIO_29           11
#define GPIO29_FUN_RF_TEST_24            12
#define GPIO29_FUN_UNUSED13              13
#define GPIO29_FUN_E21_TDI_E21_TDO       14
#define GPIO29_FUN_DEBUG_25              15
#define GPIO29_FUN_FEM_GPIO_4            16
#define GPIO29_FUN_USB_ENUM_EXT          17
#define GPIO29_FUN_USB_OEB               18
#define GPIO29_FUN_UNUSED19              19
#define GPIO29_FUN_QDEC0_LED             20
#define GPIO29_FUN_ROW_I_5               21
#define GPIO29_FUN_COL_O_9               22
#define GPIO29_FUN_CAM_RESET             23
/* GPIO30 function definition */
#define GPIO30_FUN_CLK_OUT_0           0
#define GPIO30_FUN_BT_ABORT            1
#define GPIO30_FUN_UNUSED2             2
#define GPIO30_FUN_I2S0_DIO_I2S0_DO    3
#define GPIO30_FUN_SPI_0_SS            4
#define GPIO30_FUN_I2C0_SCL            6
#define GPIO30_FUN_UART_SIG6_UART_SIG2 7
#define GPIO30_FUN_PWM_CH0             8
#define GPIO30_FUN_PIX_DAT6            9
#define GPIO30_FUN_UNUSED10            10
#define GPIO30_FUN_REG_GPIO_30         11
#define GPIO30_FUN_RF_TEST_25          12
#define GPIO30_FUN_UNUSED13            13
#define GPIO30_FUN_E21_TCK_E21_TMS     14
#define GPIO30_FUN_DEBUG_26            15
#define GPIO30_FUN_FEM_GPIO_0          16
#define GPIO30_FUN_USB_TX_DN_USB_RX_DN 17
#define GPIO30_FUN_VOP                 18
#define GPIO30_FUN_UNUSED19            19
#define GPIO30_FUN_QDEC1_A             20
#define GPIO30_FUN_ROW_I_6             21
#define GPIO30_FUN_COL_O_10            22
#define GPIO30_FUN_CAM_PWRDN           23
/* GPIO31 function definition */
#define GPIO31_FUN_CLK_OUT_1           0
#define GPIO31_FUN_BT_ACTIVE           1
#define GPIO31_FUN_UNUSED2             2
#define GPIO31_FUN_I2S0_RCLK_O_I2S0_DI 3
#define GPIO31_FUN_SPI_0_SCLK          4
#define GPIO31_FUN_I2C0_SDA            6
#define GPIO31_FUN_UART_SIG7_UART_SIG3 7
#define GPIO31_FUN_PWM_CH1             8
#define GPIO31_FUN_PIX_DAT7            9
#define GPIO31_FUN_UNUSED10            10
#define GPIO31_FUN_REG_GPIO_31         11
#define GPIO31_FUN_RF_TEST_26          12
#define GPIO31_FUN_UNUSED13            13
#define GPIO31_FUN_E21_TDO_E21_TDI     14
#define GPIO31_FUN_DEBUG_27            15
#define GPIO31_FUN_FEM_GPIO_1          16
#define GPIO31_FUN_USB_TX_OE           17
#define GPIO31_FUN_VOM                 18
#define GPIO31_FUN_UNUSED19            19
#define GPIO31_FUN_QDEC1_B             20
#define GPIO31_FUN_ROW_I_7             21
#define GPIO31_FUN_COL_O_11            22
#define GPIO31_FUN_CAM_REF_CLK         23


#endif /*__BL702_GPIO_H__ */
